---
type: Hub
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# Hub

`Autodesk.Revit.DB.Structure.Hub` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetHubConnectorManager | 2012 | `public ConnectorManager GetHubConnectorManager ()` |
| Method | GetOrigin | 2012 | `public XYZ GetOrigin ()` |
| Method | HasOrigin | 2012 | `public bool HasOrigin ()` |
| Property | Parameter | — | `` |